Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
void ledoff2(void)
{
    LED_OFF(2);
}

void ledoff3(void)
{
    LED_OFF(3);
}

// This function can be used for diagnostic reasons. Not used in RUM application.
void blink1(void)
{
    LED_ON(1);
    macSetAlarm(25, ledoff1);

    //    macSetAlarm(500, blink1);

    //    macDataRequest(0, 7, (u8*)"Howdy\r\n");
}

/**
   Application callback function, called when the MAC receives a ping request
   packet addressed to this node.

   @param addr The short address of the node that sent the ping request
*/
void appPingReq(u16 addr)
{
	#if DEBUG
    // We got a ping, send a response
    // Blip the LED
    LED_ON(2);

    macSetAlarm( LED_PING_DELAY  ,ledoff2);
	//#endif
	
    debugMsgStrConst("\r\nPing request from node ");
    debugMsgInt(addr);
	#endif
	
    #if (PLATFORM == RAVEN && SERIAL)
        // Tell 3290p
        serial_send_frame(REPORT_PING_BEEP, 2, (u8*)&addr);
	#endif
    macPing(PING_RSP_FRAME, addr);
}
/**
   Application callback function, called when the MAC receives a ping
   response packet addressed to this node.

   @param addr The short address of the node that send the ping response.
 */

/**
   Application callback function, called when the MAC receives a ping
   response packet addressed to this node.

   @param addr The short address of the node that send the ping response
 */
void appPingRsp(u16 addr)
{
    debugMsgStrConst("\r\nPing response from ");
    debugMsgHex(addr);
    debugMsgStrConst(" LQI=");
    debugMsgInt(radioGetSavedLqiValue());
    debugMsgStrConst(" RSSI=");
    debugMsgInt(radioGetSavedRssiValue());
    debugMsgCrLf();

    #if (PLATFORM == RAVEN && SERIAL)
        // Tell 3290p
        serial_send_frame(REPORT_PING_BEEP, 2, (u8*)&addr);
	#endif
	
	#if DEBUG
    // turn on the LED
    LED_ON(3);
	   // and make it turn off after a litte bit
    macSetAlarm(LED_PING_DELAY,ledoff3);
	#endif
	
	if (radioGetSavedRssiValue())
	{
		macConfig.associated =  true;
	}
 
#if(__arm__)
    gotPanCoordPing = 1;
#endif
}


/**
   Application callback function.  Called when this node receives a
    ping response via IPv6
*/
void appSixlowpanPingResponse(void)
{
    #if (PLATFORM == RAVEN)
        // Send the 3290 a frame to show that we got a ping response.
        serial_send_frame(REPORT_PING_BEEP, 0, NULL);
	#endif
}

/**
   Application callback function.  Called when this node receives a
   UDP data packet.
*/
void appSixlowpanUdpResponse(char *str)
{
    #if (PLATFORM == RAVEN)
        // Send the 3290 a frame to show that we got a ping response.
        serial_send_frame(REPORT_TEXT_MSG, strlen(str), (u8*)str);
	#endif
}

/**
   Application callback function, called when the MAC receives an ACK
   packet from a node that we sent a packet to.
*/
void appPacketSendSucceed(void)
{
    // Reset the failure count on a good packet to parent
    // (could also decrement failCount)

    if (NODETYPE != COORD)
    {
        // figure out which way we were sending when the failure occurred
        if (macConfig.lastDestAddr == macConfig.parentShortAddress)
            failCount = 0;

        // Tell sensor app
        if (APP == SENSOR)
            sensorPacketSendSucceed();

        // Tell IPv6 LOWPAN
       // if (IPV6LOWPAN)
        //    sixlowpanSleep_packetSucceed();
    }
}

/**
   Application callback function, called when the MAC fails to send a
   packet due to a channel access failure (air is too busy).
*/
void appPacketSendAccessFail(void)
{
    // Tell sensor app
    #if (APP == SENSOR)
        sensorPacketSendFailed();
	#endif
}

/**
   Application callback function, called when the MAC fails to receive
   an ACK packet from a node that we sent a packet to.
*/
void appPacketSendFailed(void)
{

    //Tell 6LoWPAN
    #if IPV6LOWPAN
        sixlowpanSleep_packetFailed();
    #endif

    u8 parentFailed;
    if (NODETYPE != COORD)
    {
        // don't mess with assessing failures during scanning
        if (macIsScanning())
            return;

        debugMsgStrConst("\r\nFail=");
        debugMsgInt(failCount+1);

        parentFailed = (macConfig.lastDestAddr == macConfig.parentShortAddress);
        /* Special code: this prevents a situation where the
           coordingator goes away, and the nodes take a long time to
           realize that the network is gone.  Nodes Keep trying to
           re-associate with each other, but until a router loses a
           number of packets to its parent, it still thinks it's
           associated.  This code forces the issue by either verifying
           that the router is still connected, or forcing a failure.    */
        // Send an empty data packet
        #if(NODETYPE == ROUTER)
		if ( parentFailed )
            macDataRequest(macConfig.parentShortAddress, 0, NULL);
		#endif
        // Don't have a cow until we have missed a few packets in a row
        if (++failCount < 3)
        {
            // Tell sensor app
            if (APP == SENSOR)
                sensorPacketSendFailed();
            return;
        }

        // A sent packet failed to reach its destination too many times
        // figure out which way we were sending when the failure occurred
        if (parentFailed)
        {
            // re-associate if we were sending upstream
            macConfig.associated = false;

            // It is possible to make the coord/end units re-connect
            // to the coordinator more quickly by not scanning all
            // available channels.  To do this, uncomment the following
            // line.
             //macSetScanChannel(macConfig.currentChannel);

            if (APP == SENSOR)
                sensorLostNetwork();
            else
            macSetAlarm(((radioRandom(8)+50) *30)+1000, appStartScan);
        }
        if (NODETYPE == ROUTER &&
            macIsChild(macConfig.lastDestAddr))
        {
            // Drop child from table if the failure was downstream
            macRemoveChild(macConfig.lastDestAddr);
            debugMsgStrConst("\r\nDropped child bcs packet send failed.");
        }
    }

