Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
}

#if DEBUG || DOXYGEN
/**
    @brief This is an array of radio register names for serial output
           used when rf2xx_reg_dump() is called.  See the radio
           datasheet for details.
*/
u8 rf2xx_reg_names[][16] =
    {"TRX_STATUS", "TRX_STATE", "TRX_CTRL_0", "TRX_CTRL_1", "PHY_TX_PWR",
     "PHY_RSSI", "PHY_ED_LEVEL", "PHY_CC_CCA", "CCA_THRES", "TRX_CTRL_2", "IRQ_MASK",
     "IRQ_STATUS", "VREG_CTRL", "BATMON", "XOSC_CTRL", "RX_SYN", "RF_CTRL_0", "XAH_CTRL_1",
     "FTN_CTRL", "RF_CTRL_1", "PLL_CF", "PLL_DCU", "PART_NUM", "VERSION_NUM", "MAN_ID_0",
     "MAN_ID_1", "SHORT_ADDR_0", "SHORT_ADDR_1", "PAN_ID_0", "PAN_ID_1",
     "IEEE_ADDR_0", "IEEE_ADDR_1", "IEEE_ADDR_2", "IEEE_ADDR_3", "IEEE_ADDR_4",
     "IEEE_ADDR_5", "IEEE_ADDR_6", "IEEE_ADDR_7", "XAH_CTRL_0", "CSMA_SEED_0",
     "CSMA_SEED_1", "CSMA_BE"};

/**
    @brief This is an array of radio register values to be used when
           rf2xx_reg_dump() is called.  See the radio datasheet for
           details.
*/
reg_addr_t rf2xx_reg_enum[] =
    {RG_TRX_STATUS, RG_TRX_STATE, RG_TRX_CTRL_0, RG_TRX_CTRL_1, RG_PHY_TX_PWR,
     RG_PHY_RSSI, RG_PHY_ED_LEVEL, RG_PHY_CC_CCA, RG_CCA_THRES, RG_TRX_CTRL_2, RG_IRQ_MASK,
     RG_IRQ_STATUS, RG_VREG_CTRL, RG_BATMON, RG_XOSC_CTRL, RG_RX_SYN, RG_RF_CTRL_0, RG_XAH_CTRL_1,
     RG_FTN_CTRL, RG_RF_CTRL_0, RG_PLL_CF, RG_PLL_DCU, RG_PART_NUM, RG_VERSION_NUM, RG_MAN_ID_0,
     RG_MAN_ID_1, RG_SHORT_ADDR_0, RG_SHORT_ADDR_1, RG_PAN_ID_0, RG_PAN_ID_1,
     RG_IEEE_ADDR_0, RG_IEEE_ADDR_1, RG_IEEE_ADDR_2, RG_IEEE_ADDR_3, RG_IEEE_ADDR_4,
     RG_IEEE_ADDR_5, RG_IEEE_ADDR_6, RG_IEEE_ADDR_7, RG_XAH_CTRL_0, RG_CSMA_SEED_0,
     RG_CSMA_SEED_1, RG_CSMA_BE};
#endif

/**
    @brief Dumps the RF2xx register contents to serial port.

    Note: The serial output will only be available if the @ref DEBUG
    macro is defined as non-zero.
*/
void rf2xx_reg_dump(void)
{
#if DEBUG
    {
        u8 i,j,k,val;
        s8 str[40];

        debugMsgStrConst("\r\n\r\nREG DUMP\r\n");

        k = sizeof(rf2xx_reg_enum)/sizeof(rf2xx_reg_enum[0]);

        for(i=0;i<k;i++)
        {
            val =  hal_register_read(rf2xx_reg_enum[i]);
            sprintf((char*)str,"%-15s - %02X ", (char *)rf2xx_reg_names[i], (uint16_t)val);
            debugMsgStr((char *)str);
            for (j=7;j<8;j--)
                // Print a bit
                debugMsgChr(((val >> j)&1 ? '1' : '0' ));
            debugMsgCrLf();
        }

        debugMsgStrConst("\r\n");
    }
#endif
}

/**
   Application function, sends a data frame to the coordinator, and
   schedules another call in two seconds, using the timer function.

   This can be used for testing the network.  To send a real data
   frame, use macDataRequest().
 */
void appSendDataFrame(void)
{
    // send data frames once per second
    if (NODETYPE != COORD)
        macDataRequest(0x00, 4, (u8*) ((NODETYPE == ENDDEVICE) ? "endd" : "rout"));

    // Send another data frame later
    macSetAlarm(1000, appSendDataFrame);
}

/**
   Callback function, called when the MAC receives a data packet for
   this node.
 */
void appDataIndication(void)
{
    // Write app code here -- This node has received a data frame.

    // Example code:
/* typedef struct { */
/*     char buf[SAMPLE_COUNT/2];  // two samples/byte */
/*     short step_index; */
/*     short predicted_value; */
/* } tEncodedBuf; */
    // Find out the type of packet.


    u8 i;
    static u8 ucDataLength;

    // Find out the type of packet
    ftData *frame = (ftData *)(mac_buffer_rx+1);
    u8 size = *mac_buffer_rx;

	ucSendDataSize = 0;

     // End_Device Radio ENTRY POINT
	 // if (!size)
	if(size ==0)
        return;
    
    if ((frame->type & 0x7f) == DATA_FRAME)
    {

        // Get the length first.
        ucDataLength = frame->payload[0];
		memset(DataBuffer,0,sizeof(DataBuffer));

        for (i = 0; i < ucDataLength; i++)
        {
            DataBuffer[i] = frame->payload[i+1];
        }
        #if (DEBUG)
        Led3_on();
        #endif

		OP = extractIncomingMessage((char*)DataBuffer);
	
	    #if (DEBUG)
        Led3_off();
        #endif
		ucNumberOfRetry = 0;
    }

}

/** 
   \brief Function to send result back to PC through serial.
   \param ucDataLength is the data size.
   \param pucDataBuffer is the pointer to the data to be sent.
 */
#if (NODETYPE == COORD)
void Serial_send_data (u8 ucDataLength, u8* pucDataBuffer)
{
    u16 i;
    serial_putchar(SOP);    // Send SOP
    serial_putchar(ucDataLength);   // Send Length
    for (i = 0; i < ucDataLength * 2; i++)
    {
        serial_putchar(pucDataBuffer[i]);
    }
    serial_putchar(EOP);    // Send EOP
}


/** 
   \brief Convert data from Hexa to String.
   \param ucDataLength is the data size.
   \param pucDataBuffer is the pointer to the data to be converted.
 */

void Hexa_to_string_convert ( u8 ucDataLength, u8* pucDataBuffer )
{
    u8 i, ucDataBuffer[ucDataLength];
    for (i = 0; i < ucDataLength; i++)
    {
        ucDataBuffer[i] = pucDataBuffer[i];
    }

    for (i = 0; i < ucDataLength; i++)
    {
        pucDataBuffer[2 * i] = Nible_to_ascii ( ucDataBuffer[i] >> 4 );
        pucDataBuffer[(2 * i) + 1] = Nible_to_ascii ( ucDataBuffer[i] );
    }
}
#endif // (NODETYPE == COORD)

/**
   Example function, starts the network by scanning channels for a coordinator.

   This node will either scan all available channels, or just one
   channel if @ref macSetScanChannel() is called.  @see macScan().
*/
void appStartScan(void)
{
    if(NODETYPE != COORD)
    {
	   #ifdef DEBUG_RADIO
        debugMsgStrConst("\r\nStart scan ");
       #endif

		//macSetScanChannel(0x0f);//BOW is operating only on this channel
        macInit(0xff);
		
        macScan();
    }

    if (IPV6LOWPAN)
        sixlowpan_application_init();
}

/**
   Callback function, called when the MAC has associated a child of
   this node to the network.

   @param shortAddress The short address of the new child node that
   has been associated.  The MAC stores this address, so the
   application should not have to.
*/
void appChildAssociated(u16 shortAddress)
{
    // Blip the LED when we associate a child
    LED_ON(2);
    macSetAlarm(LED_DELAY,ledoff2);
}

/**
   Callback function, called when the MAC has associated a new node to
   a network. This is only called for the coordinator.

