Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
   @param shortAddress The short address assigned to the new node.  The
   MAC stores this address, so the application should not have to.
*/
void appNodeAssociated(u16 shortAddress)
{
}


/**
   Callback function, called when the MAC receives an association
   confirm packet addressed to this node, or the process timed out.

   @param success True if an association packet was received, or false
   if the association process timed out.
*/
void appAssociateConfirm(u8 success)
{
    if(NODETYPE != COORD)
    {
        if (success == SUCCESS)
        {
            // send data frame after a bit
			#ifdef DEBUG_RADIO
             debugMsgStrConst("\r\nAssociated to ");
             debugMsgHex(macConfig.parentShortAddress);
             debugMsgStrConst(" as ");
             debugMsgHex(macConfig.shortAddress);
			#endif


            LED_ON(2);
            macSetAlarm(LED_DELAY,ledoff2);

            // For raven, notify other processor
            #if ((PLATFORM == RAVEN) && SERIAL)
                serial_send_frame(REPORT_ASSOCIATED, 2, (u8*)&macConfig.shortAddress);
			#endif
			
            /* 6lowpan association */
            if (IPV6LOWPAN)
                sixlowpan_hc01_gen_rs();
				
            // If we are auto-sending data, start that process.
            #if ((APP == SENSOR) && (NODETYPE != COORD))
            {
                sensorInit();
                sensorAutoSendStart();
            }
			#endif
			
			#if TRACKDEMO
            // Track Demo Application
            if (NODETYPE == ENDDEVICE)
            {
                // Re-associate every second
                macSetAlarm(1000, appStartScan);
            }
			#endif
            #if ((APP == TRACKER)  && (PLATFORM == DSK001))
            {
                // Sleep for a while
                nodeSleep(30);
                // Do the scan over
                appStartScan();
            }
			#endif
        }
        else
        {
            debugMsgStrConst("\r\nFailed to associate");

            if (VLP)
            {
                // Sleep for 10 seconds, try again
                nodeSleep(100);
                appStartScan();
            }
            else
                // Try again in one second
                //macSetAlarm(1000, appStartScan);
				macSetAlarm(((radioRandom(8)+50) *30)+1000, appStartScan);
        }
    }
}

/**
   Sample application function, associates this node to a network.
   This function is called after a successful @ref macScan.
*/
void appAssociate(void)
{
  #ifdef DEBUG_RADIO
    debugMsgStrConst("\r\nAssociating to ");
    debugMsgHex(panDescriptor.coordAddr);
    debugMsgStrConst(" on ch ");
    debugMsgInt(panDescriptor.logicalChannel);
    debugMsgStrConst(", hops = ");
    debugMsgInt(panDescriptor.hopsToCoord);
  #endif

    macAssociate(panDescriptor.coordAddr, panDescriptor.logicalChannel);
}

/**
   Callback function, called when the MAC has completed its channel scan.

   @param success True if @ref macScan found a network to connect to,
   or false if no networks were found.
*/
void appScanConfirm(u8 success)
{
    // Write app code here -- This (end or router) node has finished its scan,
    // and has received some beacons from prospective parents.

    // Example code:
    if(NODETYPE != COORD)
    {
        if (success)
        {
            // associate with coordinator
            macSetAlarm(30,appAssociate);

            #ifdef BEBUG_RADIO
             debugMsgStrConst("\r\nScan good, select chan ");
             debugMsgInt(panDescriptor.logicalChannel);
			#endif
        }
        else
        {
            // failure to find a network
            if (VLP)
            {
                // Try again after sleeping for 10 seconds
                if (NODETYPE == ENDDEVICE)
                    nodeSleep(100);
                else
                    // Router node
                    macSetAlarm(1000, appStartScan);
            }
            else
                //macSetLongAlarm(30,appStartScan);// time between scan attempts
				macSetAlarm((radioRandom(8)+5) *10, appStartScan);
				
                debugMsgStrConst("\r\nScan bad");
        }
    }
}

/**
   Callback function, called when @ref macFindClearChannel()
   completes.

   u8 channel The clear channel selected for use by this PAN.
*/
void appClearChanFound(u8 channel)
{
    if (NODETYPE == COORD)
    {
        macInit(channel);
        macStartCoord();
#if (__AVR__ || __AVR32__)
        debugMsgStrConst("\r\nStartup, I am coordinator on ch ");
#else
        fnDebugMsg("\r\nStartup, I am coordinator on ch ");
#endif // __AVR__
        debugMsgInt(channel);
        macConfig.associated = true;

#if ((IPV6_STACK == STACK_UIP) && IPV6LOWPAN)
       //Start uIP stack with 802.15.4 interface
        huip_init_802154(macConfig.panId, macConfig.shortAddress);
#endif // IPV6LOWPAN
    }
}

#if __AVR__
/**
   Verifies that the EEPROM contains valid data for the stored MAC
   address.  If the EEPROM is unprogrammed, then a random MAC address
   is written into EEPROM.

   Similarly, the sensor interval time is set to 2 seconds if the
   EEPROM is unprogrammed.
 */
void checkEeprom(void)
{

	//check for First Run
	if(PLATFORM == RCBRFA1)
	{
	    u64 NodeLongAddress;
        u32 low;
		u32 high;
        u8 regval;
		u8  i=0;	        
		
		u8 temp = READER_NEW;

        
		
        // Setup the address of this device by reading a stored address from eeprom.
        halGetMacAddr((u8*)&(NodeLongAddress));
      
        // Partition the long address
        low = NodeLongAddress & 0xffffffff;
        high = NodeLongAddress >> 32;
        
        // Vigin Board Configuration Found, 
        // Request Setup Info from Reader

		if((low == 0xFFFFFFFF) && (high == 0xFFFFFFFF)){
		    // Produce Random Number
			
			    u8 buf[8];
				u8 bits =8;

				memset(&buf,0,sizeof(buf));
			    // create random MAC address and store it
	       		radioInit(0); // Needed for random to work.
	        	radioSetTrxState(RX_ON);

				
