Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
	        	for (u8 x = 0;x < 8;x++){

					      
				  if(x < 4)
					buf[x] = 0xFF;			// Load lower 4-bytes w/ 0xFF   

				  else{
				  
			        i = radioGetTrxState();

					// Load upper 4-bytes w/ random number (4-bytes)
			        if(i == RX_ON || i == RX_AACK_ON)
					     // Must be in rx to get random numbers
			            // Random number generator on-board
			            // has two random bits each read
			            for (i=0;i<bits/2;i++)
			            {
			                regval = hal_subregister_read(SR_RND_VALUE);
			                buf[x]= (buf[x] << 2) | regval;
			            }

					}
				}


			  halPutMacAddr(buf);
			  //ReaderStateFlag.FirstRun |= VIRGIN_READER;
			  
			  halPutEeprom(READER_STATE_ADDR,READER_STATE_FLAG_SIZE,&temp);
			  eeprom_update_byte(MACHINE_LABEL_ADDR, 0); //make label empty string
			  eeprom_update_byte(MACHINE_DESCRIPTION_ADDR, 0); //make description empty string
		}

        else if((low == 0xFFFFFFFF) && (high != 0x00000000)){
            //ReaderStateFlag.FirstRun |= VIRGIN_READER;
			halPutEeprom(READER_STATE_ADDR,READER_STATE_FLAG_SIZE,&temp);
			asm("nop");
			}
/*         else{// Valid (non-fffffff) MAC addr

            //a valid reader ID has been detected. check for valid setup
            if( (ReaderStateFlag.ReaderSetup == READER_SETUP_DONE) ){
                #if (DEVICE_CONNECTED == MDC_MACHINE)
                SetMachineSetupData();  
                #endif 
				
				ReaderStateFlag.ValidateSetup = VALIDATE_READER_SETUP;
				             
            }
            
                    	            
        }	*/	
		
    }
}
#endif // __AVR__



/**
   Sample application function, which initializes the application.
   This function is meant to be called on startup only.
*/
void appInit(void)
{
	
	#if (DEVICE_CONNECTED == MDC_MACHINE)
     u8 machineCode;
	 u8 tmp=0;
	 u8 machineTimerId;
	#endif
  
    // Init the mac
    LED_INIT();
    Leds_on();
    Buzzer_init();
    Leds_off();

    // Blip the LED once on powerup
    Led1_on();

    OP = VALIDATE_READER; 	
    macSetAlarm(25, ledoff1);

	ucDeviceStateFlag = DEVICE_STATUS_NEEDED;
    

#if (__AVR__)
    // If the EEPROM is cleared, init it to something useful
    checkEeprom();
#endif // __AVR__
	
	initReader(); 

	
    #ifdef MACHINE_CONNECTED
    
        #if (DEVICE_CONNECTED == MDC_MACHINE)
        //wait up to 10 seconds for machine to become active
         machineTimerId = macSetAlarm(MACHINE_WAIT_TIMEOUT,WaitForMachine);     
     
         while(ucMachineWait == MACHINE_WAIT)
         {
            if(ucDeviceStateFlag == DEVICE_STATUS_NEEDED)
            {
				initMachine();
        	   // MachineStatus();				
                tmp = macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
            }
            else if(ucDeviceStateFlag == DEVICE_STATUS_ONLINE){
                macTimerEnd(machineTimerId);
                macTimerEnd(tmp);
                //SetDefaultMachineSetup(); //load default setup info. these values will be overwritten when reader gets setup from BOW
                break;
            }
            else if( mac_event_pending() ){
                macTask();  //timer has timed out handle timer task.
            }
      
         }	 
         macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
        #elif (DEVICE_CONNECTED == MAYTAG_MACHINE)
           // sendMTStartMessage();
           // ucDeviceStateFlag = DEVICE_STATUS_NEEDED;

        #elif (DEVICE_CONNECTED == MARS_BA)
         //call only when running cash box app
        
        initMars();

        #endif // DEVICE_CONNECTED
    #else
	  // FOR DEBUGGING USE ONLY
	 MdcStatus.MachineType[0] = 0x21;
	 MdcStatus.MachineType[1] = 1; 
  
    #endif
    /*
    #if (DEBUG == 0)
    //start heartbeat
    HeartBeat();
    #endif
    */
    #if (DEVICE_CONNECTED == MDC_MACHINE)
	// read machine code stored in EEPROM
	/********can check reader state flag here and update******/
	halGetEeprom(MACHINE_TYPE_ADDR, 1, &machineCode);
	
	//if a valid machine is connected, then store the machine type
	if((machineCode == 0xFF) && (MdcStatus.MachineType[0] != INVALID_MACHINE)) 
	{
		// save the actual machine code 
		halPutEeprom(MACHINE_TYPE_ADDR, 1, &MdcStatus.MachineType[0]);
		halPutEeprom(MACHINE_TYPE_ADDR+1, 1, &MdcStatus.MachineType[1]);
	}
	else if(MdcStatus.MachineType[0] != machineCode)
	{
		// machine has been swapped - trigger setup request
		halPutEeprom(MACHINE_TYPE_ADDR, 1, &MdcStatus.MachineType[0]);
        halPutEeprom(MACHINE_TYPE_ADDR+1, 1, &MdcStatus.MachineType[1]);
		
        ReaderStateFlag.ReaderSetup = READER_SETUP_NEEDED;//(ReaderStateFlag | READER_SETUP_NEEDED); 
        halPutEeprom(READER_STATE_ADDR,1, (u8*)&ReaderStateFlag);
	}
    #elif (DEVICE_CONNECTED == MARS_BA)
    {
        u8 temp = 0xBA;

        halPutEeprom(MACHINE_TYPE_ADDR, 1, (u8*)&temp);
    }
    
    #endif //DEVICE_CONNECTED

    // Init the mac and stuff
    if (NODETYPE == COORD)
    {
        macFindClearChannel();
    }
    else
    {
	   #ifdef DEBUG_RADIO
        debugMsgStrConst("\r\nStartup, I am router/end.");
	   #endif

        // End node or router, start scanning for a coordinator
        appStartScan();
        // when scan is finished, appScanConfirm will be called.

        //Call RUM init
        sixlowpan_init();

        #ifndef COORDNODE

            #if (DEVICE_CONNECTED == MDC_MACHINE)
			if (ucDeviceStateFlag == DEVICE_STATUS_ONLINE)
			{
				displayVersion();
				
				//Send machine setup at every power up if reader has setup and machine is connected
				if( ReaderStateFlag.ReaderSetup == READER_SETUP_DONE )
				{					
					setupMachine();
					ucCardStatus = CARD_OUT;					
					cardRemoved(REMOVE_CARD);
					//collectMdcAuditData();		
				}
			}					
            #endif //MDC_MACHINE

        #endif

    }
	//ping coord every few seconds
	//pingTimer = 0;
	//doPing();
	

asm("nop");
}

/**
   Sample application function. Sends a ping packet to the network
   coordinator.
*/
void doPing(void)
{
    hal_register_write(RG_CSMA_BE,0);
    //macDataRequest(DEFAULT_COORD_ADDR, 110, dataString);
    macPing(PING_REQ_FRAME, DEFAULT_COORD_ADDR);

    // Uncomment the next line to make the button unleash a torrent of pings
#if __AVR__ || __AVR32__
    //    pingTimer = macSetAlarmMs(5+(23*(BAND == BAND900)), doPing);
	if (pingTimer)
	{
		macTimerEnd(pingTimer);
	}
    pingTimer = macSetAlarm(10000, doPing);
#endif
}


/** 
   \brief Convert data from String to Hexa.
   \param ucDataLength is the data size.
   \param pucDataBuffer is pointer to data to be converted.
 */

void String_to_hexa_convert ( u8 ucDataLength, u8 * pucDataBuffer )
{
    u8 i, ucDataBuffer[ucDataLength * 2];

    for (i = 0; i < ucDataLength * 2; i++)
    {
        ucDataBuffer[i] = pucDataBuffer[i];
    }
    for (i = 0; i < ucDataLength; i++)
    {
        ucDataBuffer[2 * i] = Ascii_to_nible ( ucDataBuffer[2 * i] );
        ucDataBuffer[(2 * i) + 1] = Ascii_to_nible ( ucDataBuffer[(2 * i) + 1] );
        pucDataBuffer[i] = ((ucDataBuffer[2 * i]) << 4) + ucDataBuffer[(2 * i) + 1];
    }
}


/**
   Sample application task loop function.  This function is meant to
   be called periodically.  It receives data from serial and sends it
   to end device.
*/
//void appTask(void)
void APP_TaskHandler(void)
{
	//vars declaration
	ucSendDataSize = 0;
	unsigned char tmp[16];


