Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
	u8 ucTimerID=0xff;
	char *uctempBuf;
	char *ptr;

    #if( DEVICE_CONNECTED == MARS_BA )
	static u8  CustomerID[5] = {0};
	static u8 ucbillReturnTimerID = 0xff;
    #endif

	// loop to convert 
	// decimal to hexadecimal	
	///u8 i =0;
	///u8 Nibble =0;
	u8 k, l;
	u8  Setup[30]; 
	u8 n = 0;

 

	
  #ifdef MACHINE_CONNECTED
	#if (DEVICE_CONNECTED == MDC_MACHINE)
	if(ucDeviceStateFlag == DEVICE_STATUS_NEEDED)	//do machine status communication every 1/2 second
	{
        DevicePoll();
		
		
		
		if (ucDeviceStateFlag == DEVICE_STATUS_ONLINE)
		{	
			_delay_ms(5);
			//if (macConfig.associated == false)
			{
				//appPingReq(DEFAULT_COORD_ADDR);
				//appStartScan();
			}
			if (ReaderStateFlag.ReaderSetup == READER_SETUP_NEEDED)
			{
				//Display "No Setup" message on machine
				displayMsg(SETUP_MSG);				
			}
			else if (((macConfig.associated == false) && (ReaderStateFlag.EnableOfflineTransaction == false)) || (ReaderStateFlag.MaxNumTransReached == true))
			{
				//Display "Service message" message on machine
				displayMsg(SERVICE_MSG);				
			}
			else if (ReaderStateFlag.Busy == true)
			{
				#if (DEVICE_CONNECTED == MDC_MACHINE)
				//Display busy message
				if( OP != WAIT_FOR_SERVER ) // ****need to put op code in a queue****
				{
					OP = WAIT_FOR_SERVER;
				}					
				displayMsg(BUSY_MSG);
				#endif
			}
		}
		
	}
	#endif // MDC_MACHINE
	
  #endif

if(macConfig.associated == true/*/false*/ || ReaderStateFlag.EnableOfflineTransaction == true) //  Don't bother running the app until the reader has associated
{
	#if (DEVICE_CONNECTED == MARS_BA)
	if(ucDeviceStateFlag == DEVICE_STATUS_NEEDED)	//do machine status communication every 1/4 second
	{
        DevicePoll();
	}
	#endif //MARS_BA		

	
	
	switch(OP){
		case VALIDATE_READER:
		//TODO: fix machine type switch
		// 
				#if (DEVICE_CONNECTED == MDC_MACHINE) 
				if((ReaderStateFlag.EnableOfflineTransaction == true) && (ReaderStateFlag.ReaderSetup == READER_SETUP_DONE))
				{	
					OP = INIT_READER;
				}
				else{													
				#endif //MDC_MACHINE 
				
					#if (DEVICE_CONNECTED == MDC_MACHINE)
					if( ((ReaderStateFlag.ReaderSetup == READER_SETUP_NEEDED) || ( ReaderStateFlag.FirstRun == VIRGIN_READER)) && (MdcStatus.MachineType[0] != INVALID_MACHINE) ){
						
						SETUP_TIMEOUT = true;
						OP = SETUP_REQUEST; //enable when setup supported by server
					
					#elif (DEVICE_CONNECTED == MARS_BA || DEVICE_CONNECTED == MAYTAG_MACHINE)    
					if( (ReaderStateFlag.ReaderSetup == READER_SETUP_NEEDED) || ( ReaderStateFlag.FirstRun == VIRGIN_READER) ){
						//****to be removed once setup from server is enabled*****//
						u8 validationCodeSize = 0;
						 ReaderStateFlag.FirstRun = NON_VIRGIN_READER;
						ReaderStateFlag.ReaderSetup = READER_SETUP_DONE; 
						ReaderStateFlag.ValidateSetup = VALIDATE_READER_SETUP;                                        
						halPutEeprom(READER_STATE_ADDR,1,(u8*)&ReaderStateFlag);
						
						halPutEeprom(VALIDATION_CODE_ADDR, 1, &validationCodeSize); 
						//-------------------------------------------
						
					#endif
	
					}
					else if( (ReaderStateFlag.ReaderSetup == READER_SETUP_DONE) && (ReaderStateFlag.ValidateSetup == VALIDATE_READER_SETUP) ){
                       	
						VALIDATION_TIMEOUT = false;
						sendValidationRequest();
						// Clear Rx Buffer
						memset(DataBuffer,0,sizeof(DataBuffer));
					   
						macSetLongAlarm(SETUP_VALIDATION_TIMEOUT, ValidationTimeout); 		//check Every 15s

						// Wait for validation package to arrive
						OP = VALIDATE_SETUP;
                        
					}
					else if( ReaderStateFlag.ReaderSetup == READER_SETUP_DONE){
						OP = INIT_READER;
					}
				#if( DEVICE_CONNECTED == MDC_MACHINE)
				}					
				#endif //MDC_MACHINE
			break;

		case INIT_READER:
			#if (DEVICE_CONNECTED == MDC_MACHINE)
			
			if( isMachineCycleRunning() )
			{
				OP = CYCLE_STARTED;
			}
			else
			{											
				OP = SCANNING;
			}
			#elif (DEVICE_CONNECTED == MARS_BA)
				OP = WAIT_FOR_BILL;
			#endif
			
			#if ENABLE_KEYPAD
				initKeypad();
			#endif		
			 break;

		case SCANNING: //scan for card swipe

                // Enable Heart beat routine
                    if (uiFunctionEntered < (20 * (F_CPU/4000000)))
                    {
                        uiFunctionEntered++;
                    }
                    else
                    {
						#if (DEVICE_CONNECTED == MARS_BA)
							Led2_toggle();
						#else
 							Led1_toggle();
						#endif
                        uiFunctionEntered = 0;					
                    }

	
					if(!Request(ISO14443_3_REQALL, tmp))
					{
						u8 cardType;
						u8 cardKey[6] = {0xff,0xff,0xff,0xff,0xff,0xff};
						
						/*anti-collision and select the card*/
						if(!AnticollSelect(0, tmp, &cardType))
						{
							if(cardType == MIFARE_1K)
							{
								CurrentAccount.Type = MIFARE_1K;
								
								Authentication(MIFARE_AUTHENT_A,cardKey,tmp,0);
							}
							else 
							{
								CurrentAccount.Type = 0;
							}								
							OP = CARD_DETECTED;	
							ledoff1();
						}							
							
													
						#if(DEVICE_CONNECTED == MARS_BA)
							//end bill return timer once card has been detected
							macTimerEnd(ucbillReturnTimerID);
						#endif
					}
					
				#if (DEVICE_CONNECTED == MARS_BA)
					else if (ucReturnBillTimeout)
					{
						ucReturnBillTimeout = 0;
						OP = RETURN_BILL;
					}
				#endif
				
                #if ENABLE_KEYPAD
				
					else if (isKeyPressed())
					{
						OP = KEYPAD_ENTRY_DETECTED;
						//set account number entry timer
						keypadEntryTimeoutTimerID = macSetLongAlarm(KEYPAD_TIMEOUT, setKeypadEntryTimeout);
                  clearKeypadEntry();
					}

				#endif
				break;

		#if (DEVICE_CONNECTED == MARS_BA)
		case WAIT_FOR_BILL:
			// wait for bill to be escrowed
			if(MarsStatus.billState == MARS_BILL_ESCROWED)
			{				
				ucbillReturnTimerID = macSetLongAlarm(BILL_RETURN_TIMEOUT, SetBillReturn);
				OP = SCANNING;	//wait for card swipe
			}			
			break;
			
		#endif
		
