Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
		#if ENABLE_KEYPAD
        case KEYPAD_ENTRY_DETECTED:
			if (keypad.flags.keypadEntryTimedout == false)
			{//reset timer after each successful key press
            //uint8_t tmpNum[10] = {0};
           // uint8_t tmpcode[10] = {0};
                			
				if(accountNumberEntry()) 
				{//account number was entered successfully					
				 //send account info to server for processing
					if (passcodeEntry())
					{					
                  getKeypadAccountInfo();
                  OP  = SCANNING;
				      clearKeypadEntryTimeout();
               }                  
				}			
			}
			else
			{
				OP  = SCANNING;
				clearKeypadEntryTimeout();
			}
			
            break;
        #endif //KEYPAD
		
		case CARD_DETECTED:		
			{			
				

				u8 cardNum[10] = {0};	
				//memset(DataBuffer,0,sizeof(DataBuffer));	// Clear Buffer
				
				
				//Read CardID from User Zone
				if(!readCardID(CurrentAccount.Type, &cardNum[0]))
				{
					padLeft((char*)&cardNum[0],9,"200");
					
					CurrentAccount.ID = strtoul((const char*)cardNum,NULL,10);	//save active card's id
					
					if(macConfig.associated == true)
					{					
						// Send Data Package via Radio						
						sprintf((char*)ucSendDataBuffer+1, "<sN>%s</sN>",cardNum);

						ucSendDataSize = strlen((char*)ucSendDataBuffer+1);
						ucSendDataBuffer[0] = ucSendDataSize;   // Length
						ucSendDataSize = ucSendDataSize + 1;    // data size = data byte + size byte
						macDataRequest(DEFAULT_COORD_ADDR, ucSendDataSize, ucSendDataBuffer);
									
						// Clear Rx Buffer
						memset(DataBuffer,0,sizeof(DataBuffer));
					
						OP = WAIT_FOR_SERVER;
						ReaderStateFlag.Busy = true;
						
					}
					#if (DEVICE_CONNECTED == MDC_MACHINE)


					else if((macConfig.associated == false) && (ReaderStateFlag.EnableOfflineTransaction == true) && (ReaderStateFlag.MaxNumTransReached == false))
					{//allow cycle to start when BOW is down
						CurrentAccount.Value = vendPrice * 100;				 
    					//CurrentAccount.CardState = CARD_IN;
    					if( cardInserted(REGULAR_VEND) )
    					{
							
							OP = WAIT_FOR_SELECTION;
							
							KPTOFlag = 0;
							
							if( waitForMachineStartKey() )
							{
    							macSetLongAlarm(MachineSetupData.KeyPressWaitTime,KeypressTimeOut);
							}
							else
								macSetAlarm(500, KeypressTimeOut); // if connected to a washer while cycle is running and a card is swiped, just display the balance and continue scanning.								
    					
						}							
					}
					else{
						OP = SCANNING;
					}
					#endif	
											                            
					#if (DEBUG)
						Beeps(1);
					#endif

					//Set Timeout timer
					TOFlag = 0;
					ucTimerID = macSetLongAlarm(SERVER_RESPONSE_TIMEOUT,CommTimeOut);
					
				}
				else
				{					
					#if (DEBUG)
						debugMsgStr("\r\nInvalid CardID\r\n");
					#endif
					OP = SCARD_REMOVED;
				}
				}		
			break;

		case SEND_OFFLINE_TRANSACTIONS:
		
			if (timeout.sendingOfflineTransactions)
			{
				timeout.sendingOfflineTransactions = false;
				OP = IDLE;
			}
			break;
			
		case SHOW_BALANCE_REQUEST:
		case WAIT_FOR_SERVER: //wait for response from server


		    if(DataBuffer[0] != '\0')
			{
			  // Print response
			
				ReaderStateFlag.Busy = false;
				#if (DEBUG_BOW)
				debugMsgStr("\r\n");
				debugMsgStr(DataBuffer);	
				debugMsgStr("\r\n");
				#endif

				OP = SCARD_REMOVED;

                #if (DEVICE_CONNECTED == MARS_BA)

                    //Extract the Card Id				
    				if( (uctempBuf = strstr((char *)DataBuffer,"sN: ")) )
                    {				
    				    //strncpy((char *)CustomerID, (char *)(DataBuffer+9), 4);//(uctempBuf[9]-0x30) * 1000 + (uctempBuf[10]-0x30) * 100 + (uctempBuf[11]-0x30) * 10 + uctempBuf[12]-0x30;
                        CurrentAccount.ID = strtoul((const *)(DataBuffer+3),NULL,10);	//save active card's id
					
						if( (MarsStatus.billState == MARS_BILL_ESCROWED) && (MarsStatus.billValue > 0) )
                        {
                            //sprintf(ucSendDataBuffer+1, "<cardId>%s</cardId>",DataBuffer+1);
                            if( storeMarsBill() == BILL_STACKED )
								OP = ADD_CARD_VALUE;
                            
							macTimerEnd(ucTimerID);
                        }

			        }
                    else if( (uctempBuf = strstr((char *)DataBuffer,"<ReloadCustomerResult>")) )
                    {				
    				    CurrentAccount.Value = (uctempBuf[22]-0x30) * 1000 + (uctempBuf[23]-0x30) * 100 + (uctempBuf[25]-0x30) * 10 + uctempBuf[26]-0x30;
                        //storeMarsBill();
                        macTimerEnd(ucTimerID);
                        LED_ON(1);
                        macSetAlarm(5000, ledoff1);
                    }
                #else
					
					
                    //Extract the Card Id				
    				if( (uctempBuf = strstr((char *)DataBuffer,"sN: ")) )
                    {						
						CurrentAccount.ID = strtoul((const char*)(uctempBuf+4),NULL,10);	//save active card's id
						

								
    					//Display card balance on machine
    					double fBalance = 0.0;
    					uctempBuf = strstr((char *)DataBuffer,"Balance: ");
						
    					uctempBuf += 9;
    					ptr = strchr(uctempBuf,'.');
						k = ptr - uctempBuf;
						fBalance = atof(uctempBuf);
     
    					// Format the Balance to XX.XX
						if (k <2)
						 sprintf(uctempBuf,"0%.2f",fBalance);
						else if(k == 2)
						 sprintf(uctempBuf,"%.2f",fBalance);
						else
						 strcpy(uctempBuf,"99.99");
 
     					//Format the Display Balance
    					CurrentAccount.Value = (uctempBuf[0]-0x30) * 1000 + (uctempBuf[1]-0x30) * 100 + (uctempBuf[3]-0x30) * 10 + uctempBuf[4]-0x30;				 
    					//macTimerEnd(ucTimerID);


						#if(DEVICE_CONNECTED == MDC_MACHINE)
						
						// give display control back to front end controller.
						displayMsg(BLANK_MSG);
    					_delay_ms(100);
						
						if( cardInserted(REGULAR_VEND) )
    					{
    						#if(DEBUG_BOW)
    						debugMsgStr("\r\nSerialSendMachineData(CASH_CARD_INSERTED)\r\n");
    						#endif

    						//CurrentAccount.CardState = CARD_OUT;
    						OP = WAIT_FOR_SELECTION;
	
