Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
    					//Sound Buzzer
    						#if (DEBUG)
								Beeps(2);
							#endif

    						KPTOFlag = 0;
							
							if( waitForMachineStartKey() )
							{
    							macSetLongAlarm(MachineSetupData.KeyPressWaitTime,KeypressTimeOut);
							}
							else
								macSetAlarm(500, KeypressTimeOut); // if connected to a washer while cycle is running and a card is swiped, just display the balance and continue scanning.								
    					}
						#endif	//MDC_MACHINE
					}	//serial number found in server database
					else //serial number error from server database
					{
						CommTimeOut();//TOFlag = 1;	//force timeout condition
					}											
                #endif//MDC_MACHINE

			 }
			 else if(TOFlag == 1 || macConfig.associated == false) // server fails to respond in time
			 {
				#if(DEBUG_BOW)
			   	debugMsgStr("\r\nTOFlag == 1\r\n");
				#endif

				// Error Occured
				// Re-enter SCANNING mode

				#if(DEVICE_CONNECTED == MDC_MACHINE)
				if ( cardRemoved(REMOVE_CARD) )
				{
					//TOFlag = 1;
					ReaderStateFlag.Busy = false;
					//send error message to machine display
					displayMsg(CARD_ERR_MSG);				
					OP = IDLE;
				}
				
				#if (DEBUG_BOW)
				debugMsgStr("\r\nServer Communication Error\r\n");
				#endif
                
				#elif(DEVICE_CONNECTED == MARS_BA)
                    //add value failed, return the bill.
                   OP = RETURN_BILL;

                #endif // DEVICE_CONNECTED
			             
			 }

             //asm("nop");
			 break;

		case WAIT_FOR_SELECTION: //wait to see if cycle start has been requested by user

			#if(DEVICE_CONNECTED == MDC_MACHINE)
            if( (MdcStatus.CmdToReader == DEDUCT_VEND_COMMAND || MdcStatus.CmdToReader == DEDUCT_TOPOFF_COMMAND) )
			{
					OP = START_CYCLE; // set only if vend price deduction successful.

			}
			else if(KPTOFlag == 1)
			{			
				if ( cardRemoved(CASH_CARD) )
				{
					//CurrentAccount.CardState = CARD_OUT;
					OP = SCANNING;
				}
			}
			#endif
            			
			break;

		case START_CYCLE:	// send start cycle command to machine

            #if(DEVICE_CONNECTED == MDC_MACHINE)

			if( startMachineCycle() )//SerialSendMachineData(MACHINE_START_COMMAND) )
			{
				
				structTransaction vend;
				
				
				
				vend.CardId			= CurrentAccount.ID;
				vend.vendPrice		= vendPrice * 100;
				vend.LocationId		= ReaderSetup.locationId;
				vend.ManufactureId	= ReaderSetup.manufacturerId;
				vend.MachineId[0]	= deviceStatus.deviceType[0];
				vend.MachineId[1]	= deviceStatus.deviceType[1];
				
				
				
				if((macConfig.associated == false) && (ReaderStateFlag.EnableOfflineTransaction == true))
				{//must be offline transaction, store a record.
					vend.isOffline = true;
					storeOfflineTransaction(CurrentAccount.ID);					
				}
				else{
					vend.isOffline = false;	
					CurrentAccount.Value -= (vendPrice*100);
					sendCCTransaction(&vend);
				}				
				OP = CYCLE_STARTED;
				
				//let server know machine is in use.

			}
			
			cardRemoved(CASH_CARD);
			
				
            #endif

		    break;

		case CYCLE_STARTED: // WASH COMPLETED
			
            #if(DEVICE_CONNECTED == MDC_MACHINE)
		/*	if( (MdcStatus.MachineStatus[0] & MACHINE_END_MODE) || (MdcStatus.MachineStatus[0] == MACHINE_ERROR_MODE))
			{*/
                //Error mode must be handled
                //send status to server.
				//LED_ON(2); //indicate cycle is running
				OP = SCANNING;
		/*	}
			else{   //check for server communication request or cancellation request from service tech

            }*/
            
            #endif
                
			break;



		case TIME_OUT: // Server Communication Error Occurred


              break;
		case SETUP_REQUEST:
		
			if( SETUP_TIMEOUT == true)
			{				
				#if(DEVICE_CONNECTED == MDC_MACHINE)
            
    			#ifdef MACHINE_CONNECTED
    			DevicePoll();
				/*if( MdcStatus.MachineType == INVALID_MACHINE )
				{   //Error with machine code; error mode must be handled.
					OP = SCANNING;
					break;
				}*/
				#else
    			deviceStatus.deviceType[0] = 33;
				deviceStatus.deviceType[1] = 1;
    			#endif
				#endif //DEVICE_CONNECTED
				sendSetupRequest();
			
				SETUP_TIMEOUT = false;
				macSetLongAlarm(SETUP_REQUEST_TIMEOUT, SetupTimeout);
			}			
			 break;

		
		//case SETUP_PACKAGE:
          //{
//
          //}
			//break;
			
		case VALIDATE_SETUP: 

		    	if((ptr = GetParam((char *)DataBuffer,"<ValidationResponse>","<")) != NULL)
				{  
				

					  u8 addr[8];
                      static u8 Len =0;
					  n = strlen(ptr);
				      k = 0;
					  l = 0;
					  			
				    // Get length of Validation code
				   		halGetEeprom(VALIDATION_CODE_ADDR,1,&Len);
																    
				   // 	Get Validation Code from EEPROM
						halGetEeprom(((u8*)VALIDATION_CODE_ADDR+1),Len,addr);
 
						while (k < n)
						{
							Setup[l] = (Ascii_to_nible ( *(ptr+k) ) * 16) 
									 +  Ascii_to_nible ( *(ptr+k+1));
							k += 2;
							l++;
						}



				    if(memcmp(addr,Setup,Len) == 0)
					{
                        ReaderStateFlag.ValidateSetup = VALID_READER_SETUP; //Don't store this bit in eeprom it allows for validation check on every power cycle.
			            OP = VALIDATE_READER;
					}						
					else
					{
					 OP = SETUP_REQUEST; // validation failed, request new setup info
                     SETUP_TIMEOUT = true;
					}					 
				 }

                     // Reposnse TIMEOUT
				if(VALIDATION_TIMEOUT)
				{
					VALIDATION_TIMEOUT = false;
					sendValidationRequest();// Re-send Validation Request
					
					macSetLongAlarm(SETUP_VALIDATION_TIMEOUT, ValidationTimeout); 		//check Every 5s
				}	

				   
				    			
			break;

        case UPDATE_READER_FIRMWARE:
            //process firmware update request from BOW
            
            break;

  

		#if (DEVICE_CONNECTED == MARS_BA)
        case ADD_CARD_VALUE:
			
			if(ReaderStateFlag.ReaderSetup == READER_SETUP_DONE)
			{
				structBATransaction addValue;
				/*
				char tmpCardIdString[10] = {0};
				
				padLeft(&tmpCardIdString[0],9,"0");
				
				ultoa(CurrentAccount.ID,tmpCardIdString,10);	
			          
				sprintf((char*)ucSendDataBuffer+1, "<ReloadCustomer>"
										"<sN>%s</sN>"
                                        "<reloadValue>%d</reloadValue></ReloadCustomer>"
										,tmpCardIdString, MarsStatus.billValue);
                 					
				ucSendDataSize = strlen((char*)ucSendDataBuffer+1);
				ucSendDataBuffer[0] = ucSendDataSize;   // Length
				ucSendDataSize = ucSendDataSize + 1;    // data size = data byte + size byte
				macDataRequest(DEFAULT_COORD_ADDR, ucSendDataSize, ucSendDataBuffer);
        */
				addValue.cardId = CurrentAccount.ID;
				addValue.cashValue = MarsStatus.billValue;
				getDate(&addValue.date);
				getTime(&addValue.time);
				sendRelaodCustomerTransaction(&addValue);
				// Clear Rex Buffer
				//memset(DataBuffer,0,sizeof(DataBuffer));

				//Set Timeout timer
				TOFlag = 0;
				ucTimerID = macSetAlarm(SERVER_RESPONSE_TIMEOUT,CommTimeOut);
				OP = WAIT_FOR_SERVER;			   
			
