Bondzio/ATmega128RFA1-AT86RF231-Reader-Firmware/Reader_Gen/Application/application.c
			}			
            break;
		
        case RETURN_BILL:
				
            if(returnMarsBill() == BILL_RETURNED)
			{
				Led1_on();
				_delay_ms(500);
				Led1_off();
				_delay_ms(500);
				Led1_on();
				_delay_ms(500);
				Led1_off();
			}					
            OP = WAIT_FOR_BILL;
            break;
			
		#endif	//MARS_BA
        case IDLE:
			#if( DEVICE_CONNECTED == MARS_BA )
				OP = WAIT_FOR_BILL;
			#else
				OP = SCANNING;
			#endif
			
			break;
		case SCARD_REMOVED:

            #if(DEVICE_CONNECTED == MDC_MACHINE)
			ucCardStatus = CARD_OUT;
			cardRemoved(REMOVE_CARD);
			//SerialSendMachineData(CARD_REMOVED);
			#endif

			#if( DEVICE_CONNECTED == MARS_BA )
				OP = WAIT_FOR_BILL;
			#else
				OP = SCANNING;
			#endif
			
			break;
		case BOW_ERROR:
			OP = IDLE;
			break;
			
		case APP_INIT:
			appInit();
			break;
			
		default:
				break;
} //switch


}// macConfig.associated

}

void ValidationTimeout()
{ VALIDATION_TIMEOUT = true;}

char * GetParam(char *ptrBuffer, char *tmpstr, char *EndChar)
{

  char *pStr;
  char *pStr2;
  u8 tmpstrlen =0;


  tmpstrlen = strlen(tmpstr);

   if((pStr = strstr(ptrBuffer,tmpstr)) != NULL){ //1
       if((pStr2 = strstr(pStr + tmpstrlen,EndChar)) != NULL){ //2 "<"
             memcpy(ParamStr,pStr + tmpstrlen, pStr2-(pStr+tmpstrlen));
              ParamStr[pStr2-(pStr + tmpstrlen)]  ='\0';

              return (char *)ParamStr;
        }//1
    }//2
 
 return '\0';
}

/**
   Callback function, called when the MAC finds no clear channel.
   This function will send packet again until the maximum retry number is reached.
 */
void appResendPacket(void)
{
#if (NODETYPE == COORD)
    associatedNodes_t *node;
	u64 *ulLongAddress;
    u8 ucResult[2];

    // Command has not been sent because clear channel was not found, try to re-send.
	if (ucNumberOfRetry < MAX_RETRY_TO_SEND_DATA)
	{
		node = macGetNode(1);
		ulLongAddress = &(node->nodeLongAddress); // Get node 1 long address
    	macDataRequest(macGetNodeAddr(ulLongAddress), ucSerialReceiveDataBuffer[0] + 1, (u8*) ucSerialReceiveDataBuffer);
		ucNumberOfRetry++;
        debugMsgStr("Send command again\n\r");
		// Re-start timer to wait for result.
        Timer2_set ( 0x00, 0x07 );
	}
	else
	{
        // Can not send command.
		Timer2_stop ();
        ucResult[0] = CAN_NOT_SEND_CMD;
        Hexa_to_string_convert(1, ucResult);
        // Send error code
        // When sending data to serial, the total of data must not be multiple 
        // of 16 bytes otherwise the data will not directly displayed by serial 
        // terminal.
        Serial_send_data (1, ucResult);
		ucSendCmdState = START;
	}

#elif (NODETYPE == ENDDEVICE)
    // Command has not been sent because clear channel was not found, try to re-send.
	if (ucNumberOfRetry < MAX_RETRY_TO_SEND_DATA)
	{
    	macDataRequest(DEFAULT_COORD_ADDR, ucSendDataSize, ucSendDataBuffer);
#if (DEBUG)
        debugMsgStr("Send result again\n\r");
#endif
	}
    else
    {
#if (DEBUG)
        // Can not send result.
        debugMsgStr("Can't send result\n\r");
#endif
    }
#endif
}
/** @} */

#ifndef COORDNODE 

 void Beeps(u8 nBeeps)
  {
	   for(u8 i= 0; i < nBeeps;i++)
		{
			for(u16 i= 0; i < 100;i++)
		{
			 Buzzer_on();
			_delay_us(200);
			Buzzer_off();
			_delay_us(200);
		}
		_delay_ms(25);
	}
}


void CommTimeOut()
{
	TOFlag = true;
	ReaderStateFlag.Busy = false; 
}

void KeypressTimeOut()
{
	KPTOFlag = true;
}

void HeartBeat()
{
    static u8 ucHeartBeatTimer = 0;
    if( ucHeartBeatTimer != 0 )
        macTimerEnd(ucHeartBeatTimer);
    Led2_toggle();
   ucHeartBeatTimer = macSetAlarm(HEARTBEAT, HeartBeat);
}

void SetupTimeout()
{
	SETUP_TIMEOUT = true;
}

#if (DEBUG_BOW)

void DetermineState()
{

   switch (OP)
   {

	case SETUP_RESPONSE:
        debugMsgStr("\n\rSETUP_RESPONSE:\n\r");
		break;	

	case SETUP_REQUEST:
        debugMsgStr("\n\rSETUP_REQUEST:\n\r");
		break;

	case SETUP_PACKAGE:
        debugMsgStr("\n\rUPDATE_READERID:\n\r");
		break;

	case INIT_READER:
	    debugMsgStr("\n\rINIT_READER:\n\r");
		break;
		
	case SCANNING:
		debugMsgStr("\n\rSCANNING:\n\r");
		break;		

	case CARD_DETECTED:
	    debugMsgStr("\n\rCARD_DETECTED:\n\r");
		break;	

	case CYCLE_STARTED:
	    debugMsgStr("\n\rCYCLE_STARTED:\n\r");
		break;		

	case SCAN_ENABLE:
	    debugMsgStr("\n\rSCAN_ENABLE:\n\r");
		break;			

	case DISABLE_SCAN:
	    debugMsgStr("\n\rDISABLE_SCAN:\n\r");
		break;			

	case WAIT_FOR_RESPONSE:
	    debugMsgStr("\n\rWAIT_FOR_RESPONSE:\n\r");
		break;		

	case TIME_OUT:
	    debugMsgStr("\n\rTIME_OUT:\n\r");
		break;				

	case WAIT_FOR_SELECTION: 
	    debugMsgStr("\n\rWAIT_FOR_SELECTION:\n\r");
		break;	 

	case ENABLE_SCAN:
	    debugMsgStr("\n\rENABLE_SCAN:\n\r");
		break;					

	case SCARD_REMOVED:	
	    debugMsgStr("\n\rSCARD_REMOVED:\n\r");
		break;		

	case START_CYCLE:			
	    debugMsgStr("\n\rSTART_CYCLE:\n\r");
		break;

     default:
    break;
	 
	}

}
#endif // (DEBUG_BOW)

void ProcessServerResponse(void)
{

}


void SetDeviceState(void)
{
	ucDeviceStateFlag = DEVICE_STATUS_NEEDED;
}

void DevicePoll(void) 
{
    #if (DEVICE_CONNECTED == MDC_MACHINE || DEVICE_CONNECTED == MAYTAG_MACHINE)

        MachineStatus();
		macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
		//ucDeviceStateFlag = DEVICE_STATUS_DONE;
		
    #elif (DEVICE_CONNECTED == MARS_BA)
       
        pollMars();
      /*  if(((MarsStatus.BillState == MARS_BILL_ESCROWED) && (MarsStatus.BillValue > 0)) && (ucReturnBillTimeout == 0))
        {
            ucReturnBillTimeout = 1;
            macSetAlarm(BILL_RETURN_TIMEOUT, SetBillReturn);
        }
        else if(((MarsStatus.BillState == MARS_BILL_ESCROWED) && (MarsStatus.BillValue > 0)) && (ucReturnBillTimeout == 2) && (OP != WAIT_FOR_SERVER) )
        {
            OP = RETURN_BILL;
            ucReturnBillTimeout = 0;
        }*/
    #endif

}

void SetBillReturn(void)
{
    ucReturnBillTimeout = 2;
}

char * padLeft(char * string, u8 paddedLength, const char * pad) 
{
	size_t stringLength = strlen(string);
	size_t lenpad = strlen(pad);
	u8 i = paddedLength;
	
	if (stringLength >= paddedLength)
	{
		return NULL;//'\0';
	}

	char * padded = (char*)malloc(paddedLength + 1); // allocate memory for new string
	
	for(; paddedLength > stringLength; paddedLength--, padded += lenpad)
	{
		strncpy(padded, pad, lenpad);
	}
	
	strncpy(padded, string, stringLength); /* copy without '\0' */
	padded += stringLength; /* prepare for first append of pad */
	*padded = '\0';

	padded = (padded - i);
	strncpy(string,padded,i);
	
	return padded;
}
#endif // ifndef COORDNODE


